connector/src/main/resources/com/gooddata/msdynamics/RetrieveCrmTicket.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Body>
        <ns1:Execute xmlns:ns1="http://schemas.microsoft.com/crm/2007/CrmDiscoveryService">
            <ns1:Request xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:RetrieveCrmTicketRequest">
                <ns1:OrganizationName><![CDATA[%ORGANIZATION%]]></ns1:OrganizationName>
                <ns1:PassportTicket><![CDATA[%LIVEID%]]></ns1:PassportTicket>
            </ns1:Request>
        </ns1:Execute>
    </soapenv:Body>
</soapenv:Envelope>